{"id":"6c4d4aba-a81a-4866-a470-1fe84bd17d8a","order":"a0","type":"Heading1","text":"The Lantern Street Book Club","spans":[],"indent":0,"checked":false,"lang":""}
{"id":"83067a5d-eee5-4880-b947-cbc32d43ae64","order":"a1","type":"Paragraph","text":"On Tuesdays at seven, the bell above Greer’s Corner Bakery rang exactly nine times as the members of the Lantern Street Book Club stepped in from the rain. They did not meet in a library, or a school, or any official hall. They met between sacks of flour and cooling trays of cinnamon rolls, where the owner pushed two tables together and called it literature.","spans":[],"indent":0,"checked":false,"lang":""}
{"id":"a229ae81-1e3d-4a89-9baf-25d1738a6a3e","order":"a2","type":"Paragraph","text":"There was Mara, who underlined every sentence that made her angry, and Ben, who never finished a book but always had the best theories. Nora read only first editions and wore white gloves to turn the pages. And then there was Eli, who had moved to town with one suitcase and a notebook full of blank lines, as if he expected the right story to arrive and fill it for him.","spans":[],"indent":0,"checked":false,"lang":""}
{"id":"acedc9e0-2a44-4637-be33-537430916fbe","order":"a3","type":"Paragraph","text":"That month’s pick was an old detective novel that smelled faintly of cedar and ink. Halfway through chapter eleven, Mara found a folded note tucked between the pages. It was not printed. It was handwritten in neat blue script: If you want the ending, meet where the town forgot its clock. The room went still. Ben said it was a prank. Nora said it was a crime. Eli said, very quietly, that it sounded like an invitation.","spans":[],"indent":0,"checked":false,"lang":""}
{"id":"6f30b627-6b68-4d97-b683-50ce1a8b8181","order":"a4","type":"Paragraph","text":"So they went, all four of them, with bakery aprons still dusted in sugar, to the abandoned train station at the edge of Lantern Street. The old clock above the entrance had stopped at 4:12 twenty years earlier and never been repaired. Inside, under a broken timetable board, they found a small tin box. In it sat twelve notes, one for each chapter, each written by someone who had once belonged to the same book club and had disappeared from town one summer without explanation.","spans":[],"indent":0,"checked":false,"lang":""}
{"id":"f8c43bbd-4085-4aed-b342-f1016096cc23","order":"a5","type":"Paragraph","text":"The notes were not clues to a mystery in the book. They were letters to future readers: reminders to argue honestly, read slowly, and never pretend to like a chapter just to sound clever. The twelfth letter was signed by Iris Vale, the retired librarian everyone in town thought had moved away. At the bottom she had written, Stories are not escapes. They are maps. Leave one for someone else.","spans":[],"indent":0,"checked":false,"lang":""}
{"id":"fbcaad75-551e-4d1d-a81c-dc27bca55c64","order":"a6","type":"Paragraph","text":"The next Tuesday, the bell rang nine times again. The cinnamon rolls cooled on their trays. The club sat down, but this time Eli opened his blank notebook and tore out the first page. He wrote a single line, folded it, and slid it into their next book before anyone could stop him. By spring, people whispered that the Lantern Street Book Club always chose excellent novels. No one knew why. The members did, and they never corrected anyone.","spans":[],"indent":0,"checked":false,"lang":""}
